
Перем ТекстСообщенияДляЗаписи;
Перем ЭтоНовыйДокумент;

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЭтоНовыйДокумент = ЭтоНовый();
	
	Если ОбменДанными.Загрузка Тогда
     Возврат;
	КонецЕсли;

    Если Не ЭтоНовыйДокумент Тогда

        СтарыйОбъект = Ссылка.ПолучитьОбъект();

        Изменения = Новый Массив;

        // Сравниваем дату и время.
        Если ДатаПроведенияРабот <> СтарыйОбъект.ДатаПроведенияРабот Тогда

            Изменения.Добавить(
                " дата проведения работ изменена с "
                + Формат(СтарыйОбъект.ДатаПроведенияРабот, "ДФ=dd.MM.yyyy")
                + " на "
                + Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy"));

        КонецЕсли;

        // Сравниваем специалиста.
        Если Специалист <> СтарыйОбъект.Специалист Тогда

            Изменения.Добавить(
                " специалист изменён с "
                + Строка(СтарыйОбъект.Специалист)
                + " на "
                + Строка(Специалист));

        КонецЕсли;
        
        // Сравниваем время работ.
        Если ВремяНачалаРаботПлан <> СтарыйОбъект.ВремяНачалаРаботПлан
        Или ВремяОкончанияРаботПлан <> СтарыйОбъект.ВремяОкончанияРаботПлан Тогда

            Изменения.Добавить(
                " время работ изменено с: "
                + СтарыйОбъект.ВремяНачалаРаботПлан + " - " + СтарыйОбъект.ВремяОкончанияРаботПлан
                + " на "
                + ВремяНачалаРаботПлан + " - " + ВремяОкончанияРаботПлан
                + ".");
                
        КонецЕсли;

        // Формируем сообщение, только если обнаружены изменения.
        Если Изменения.Количество() > 0 Тогда

            ТекстСообщенияДляЗаписи =
                "Изменён документ «Обслуживание клиента» №" + СтарыйОбъект.Номер
                + " от "
                + Формат(СтарыйОбъект.Дата, "ДФ=dd.MM.yyyy") + ":" + СтрСоединить(Изменения, "; ");

        КонецЕсли;

    КонецЕсли;

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
     Возврат;
	КонецЕсли;

	Если ЭтоНовыйДокумент Тогда
		
        ТекстСообщенияДляЗаписи = "Создан документ «Обслуживание клиента: №" + Номер
			+ " от " + Формат(Дата, "ДФ=dd.MM.yyyy") + ". " + "Дата проведения работ: "
        	+ Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy") + "; специалист: " + Строка(Специалист)
        	+ "; время работ: " + ВремяНачалаРаботПлан + " - " + ВремяОкончанияРаботПлан;
	
	КонецЕсли;

    Если ПустаяСтрока(ТекстСообщенияДляЗаписи) Тогда
        Возврат;
    КонецЕсли;

    НовоеСообщение = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
    НовоеСообщение.ТекстСообщения = ТекстСообщенияДляЗаписи; 
    НовоеСообщение.Записать();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействия КАК ДатаНачалаДействияДоговора,
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействия КАК ДатаОкончанияДействияДоговора,
	|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Договор";

	Запрос.УстановитьПараметр("Договор", Договор);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		ВызватьИсключение "Договор не найден!";
	КонецЕсли;

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();

	Выборка = РезультатЗапроса.Выбрать();

	Выборка.Следующий();
	СтоимостьЧасаРаботы = Выборка.СтоимостьЧасаРаботы;
	ДатаНачалаДействияДоговора = Выборка.ДатаНачалаДействияДоговора;
	ДатаОкончанияДействияДоговора = Выборка.ДатаОкончанияДействияДоговора;
	ВидДоговора = Выборка.ВидДоговора;

	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_Абонент И ДатаНачалаДействияДоговора <= Дата И Дата
		<= ДатаОкончанияДействияДоговора Тогда
			
	// регистр ВКМ_ВыполненныеКлиентуРаботы
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		Для Каждого ТекСтрокаВыполненныеРаботы Из ВыполненныеРаботы Цикл
			Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Клиент = Клиент;
			Движение.Договор = Договор;
			Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ФактическиПотраченоЧасов;
			Движение.СуммаКОплате = Движение.КоличествоЧасов * СтоимостьЧасаРаботы;
		КонецЦикла;
	
	КонецЕсли;
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ

КонецПроцедуры