&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    УстановитьВидимостьРеквизитовАбонентскогоОбслуживания();

КонецПроцедуры


&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

    УстановитьВидимостьРеквизитовАбонентскогоОбслуживания();

    Если Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Абонент") Тогда
        ОчиститьРеквизитыАбонентскогоОбслуживания();
    КонецЕсли;

КонецПроцедуры


&НаКлиентеНаСервере
Процедура УстановитьВидимостьРеквизитовАбонентскогоОбслуживания()

    Элементы.ГруппаАбонентскоеОбслуживание.Видимость =
        (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.Абонент"));

КонецПроцедуры


&НаКлиенте
Процедура ОчиститьРеквизитыАбонентскогоОбслуживания()

    Объект.ДатаНачала = Дата(1, 1, 1);
    Объект.ДатаОкончания = Дата(1, 1, 1);
    Объект.СуммаАбонентскойПлаты = 0;
    Объект.СтоимостьЧаса = 0;

КонецПроцедуры