#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьВидимостьРеквизитовНаСервере();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)

    УстановитьВидимостьРеквизитовНаКлиенте();

    Если Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_Абонент") Тогда
        ОчиститьРеквизитыАбонентскогоОбслуживания();
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьРеквизитовНаСервере()

    Элементы.ГруппаАбонентскоеОбслуживание.Видимость =
        (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_Абонент"));

КонецПроцедуры




&НаКлиенте
Процедура УстановитьВидимостьРеквизитовНаКлиенте()

    Элементы.ГруппаАбонентскоеОбслуживание.Видимость =
        (Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_Абонент"));

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьРеквизитыАбонентскогоОбслуживания()

    Объект.ВКМ_ДатаНачалаДействия = Дата(1, 1, 1);
    Объект.ВКМ_ДатаОкончанияДействия = Дата(1, 1, 1);
    Объект.ВКМ_АбонентскаяПлата = 0;
    Объект.ВКМ_СтоимостьЧасаРаботы = 0;

КонецПроцедуры

#КонецОбласти

