Процедура ОтправитьУведомления() Экспорт

	Запрос = Новый Запрос;
	
    Запрос.Текст =
    "ВЫБРАТЬ
    |	Уведомления.Ссылка КАК Ссылка,
    |	Уведомления.ТекстСообщения КАК ТекстСообщения,
    |	Уведомления.ПометкаУдаления КАК ПометкаУдаления
    |ИЗ
    |	Справочник.ВКМ_УведомленияТелеграмБоту КАК Уведомления
    |ГДЕ
    |	НЕ Уведомления.ПометкаУдаления";

    Выборка = Запрос.Выполнить().Выбрать();

    Пока Выборка.Следующий() Цикл

		Если Выборка.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;

		Попытка

			УспешноОтправлено = ВКМ_ОтправкаВТелеграм.ОтправитьСообщение(Выборка.ТекстСообщения);

			Если УспешноОтправлено Тогда
				ОбъектУведомления = Выборка.Ссылка.ПолучитьОбъект();
				ОбъектУведомления.УстановитьПометкуУдаления(Истина);
			КонецЕсли;

		Исключение

			ЗаписьЖурналаРегистрации("Отправка уведомлений Telegram",
				УровеньЖурналаРегистрации.Ошибка, , Выборка.Ссылка, ОписаниеОшибки());

		КонецПопытки;

	КонецЦикла;

КонецПроцедуры